lison0103/stm32f107_sf/BSP/sys.h
/*******************************************************************************
* File Name          : sys.h
* Author             : lison
* Version            : V1.0
* Date               : 03/22/2016
* Description        : 
*			          
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __SYS_H
#define __SYS_H	

/* Includes ------------------------------------------------------------------*/
#ifdef GEC_SF_S_NEW
#include "stm32f30x.h"
#else
#include "stm32f10x.h"
#endif
#include "stdio.h"
#ifdef GEC_SF_MASTER
#include "usbd_cdc_vcp.h"
#endif

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/** Bit operating **/
/** IO port operations macros **/
#define BITBAND(addr, bitnum) ((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2)) 
#define MEM_ADDR(addr)  *((volatile unsigned long  *)(addr)) 
#define BIT_ADDR(addr, bitnum)   MEM_ADDR(BITBAND(addr, bitnum)) 

/** IO Port Address Mapping **/
#define GPIOA_ODR_Addr    (GPIOA_BASE+12) //0x4001080C 
#define GPIOB_ODR_Addr    (GPIOB_BASE+12) //0x40010C0C 
#define GPIOC_ODR_Addr    (GPIOC_BASE+12) //0x4001100C 
#define GPIOD_ODR_Addr    (GPIOD_BASE+12) //0x4001140C 
#define GPIOE_ODR_Addr    (GPIOE_BASE+12) //0x4001180C 
#define GPIOF_ODR_Addr    (GPIOF_BASE+12) //0x40011A0C    
#define GPIOG_ODR_Addr    (GPIOG_BASE+12) //0x40011E0C    

#define GPIOA_IDR_Addr    (GPIOA_BASE+8) //0x40010808 
#define GPIOB_IDR_Addr    (GPIOB_BASE+8) //0x40010C08 
#define GPIOC_IDR_Addr    (GPIOC_BASE+8) //0x40011008 
#define GPIOD_IDR_Addr    (GPIOD_BASE+8) //0x40011408 
#define GPIOE_IDR_Addr    (GPIOE_BASE+8) //0x40011808 
#define GPIOF_IDR_Addr    (GPIOF_BASE+8) //0x40011A08 
#define GPIOG_IDR_Addr    (GPIOG_BASE+8) //0x40011E08 
 

#define PAout(n)   BIT_ADDR(GPIOA_ODR_Addr,n)  /** OUTPUT **/
#define PAin(n)    BIT_ADDR(GPIOA_IDR_Addr,n)  /** INPUT **/

#define PBout(n)   BIT_ADDR(GPIOB_ODR_Addr,n)  /** OUTPUT **/ 
#define PBin(n)    BIT_ADDR(GPIOB_IDR_Addr,n)  /** INPUT **/ 

#define PCout(n)   BIT_ADDR(GPIOC_ODR_Addr,n)  /** OUTPUT **/ 
#define PCin(n)    BIT_ADDR(GPIOC_IDR_Addr,n)  /** INPUT **/

#define PDout(n)   BIT_ADDR(GPIOD_ODR_Addr,n)  /** OUTPUT **/ 
#define PDin(n)    BIT_ADDR(GPIOD_IDR_Addr,n)  /** INPUT **/

#define PEout(n)   BIT_ADDR(GPIOE_ODR_Addr,n)  /** OUTPUT **/ 
#define PEin(n)    BIT_ADDR(GPIOE_IDR_Addr,n)  /** INPUT **/

#define PFout(n)   BIT_ADDR(GPIOF_ODR_Addr,n)  /** OUTPUT **/ 
#define PFin(n)    BIT_ADDR(GPIOF_IDR_Addr,n)  /** INPUT **/

#define PGout(n)   BIT_ADDR(GPIOG_ODR_Addr,n)  /** OUTPUT **/ 
#define PGin(n)    BIT_ADDR(GPIOG_IDR_Addr,n)  /** INPUT **/


/* if not use usb debug ,this macro should be 0 */
#ifdef GEC_SF_MASTER
#define DEBUG_PRINTF    1
#else
#define DEBUG_PRINTF    1
#endif

/* Exported functions ------------------------------------------------------- */
u32 GetLockCode(void);		
//以下为汇编函数
void WFI_SET(void);	//执行WFI指令
void INTX_DISABLE(void);//关闭所有中断
void INTX_ENABLE(void);	//开启所有中断
void MSR_MSP(u32 addr);	//设置堆栈地址


#endif  /* __SYS_H */


/******************************  END OF FILE  *********************************/







